TRACKS_DATA = [
    {
        "name": "🏚️ Страшний дім(Dance Remix)",
        "url": "https://www.youtube.com/watch?v=ltO4J5YEsQw",
        "lyrics": """
[Интро]
DJ Shadow

[Куплет]
Я забираю тебя в страшный дом
И там будем мы вдвоём
Вайперра такой отстой
Лишь гробовщики впер—

[Бридж]
Я забираю (DJ Shadow)

[Куплет]
Я забираю тебя в страшный дом
И там будем мы вдвоём
Вайперра такой отстой
Лишь гробовщики вперёд
Я забираю тебя в страшный дом
И там будем мы вдвоём
Вайперра такой отстой
Лишь гробовщики вперёд

[Бридж]
Я забираю тебя, я забираю тебя
Будем, будем
—рра так—, —рра так—
—бовщик, —бовщик
        """
    },
    {
        "name": "🏚️ Страшний дім",
        "url": "https://www.youtube.com/watch?v=joHvbz620tg&list=OLAK5uy_m6YWjNj-mNFwCaRcL12S_t9nGUSNzpKCo&index=7",
        "lyrics": """
[Припев]
Я забираю тебя в страшный дом
И там будем мы вдвоём
Вайперра такой отстой
Лишь гробовщики вперёд

[Куплет]
Карты, деньги, два ствола
Приезжает в страшный дом и остаётся навсегда
Осторожно, приведения могут утащить тебя
И там за полем у обрыва тебя ждёт бензопила
Если хочешь быть со мной, то надень свои New Rock'и
И надень тишку Affliction, что сидит так хорошо
Мы пойдём гулять в лес, ты не останешься одна
Забираю в страшный дом, и забираю навсегда

[Предприпев]
Я забираю тебя в страшный дом
И там будем мы вдвоём
Вайперра такой отстой
Лишь гробовщики вперёд

[Припев]
Я забираю тебя в страшный дом
И там будем мы вдвоём
Вайперра такой отстой
Лишь гробовщики вперёд
        """
    },
    {
        "name": "⚰️ Гробовщики",
        "url": "https://www.youtube.com/watch?v=kGGNTYUwR_o",
        "lyrics": """
[Интро]
Гробовщики, да, я неформал
Покупай Affliction и идём скорее к на—
Ха, ха-а
Е-а, а
Гробовщики, гробовщики (Е-е)
Ха-а-а

[Припев]
Гробовщики, гробовщики
Мы не VIPERR, мы не Toxi$, мы гробовщики
Гробовщики, гробовщики
Я надену True Religion, мы гробовщики

[Куплет]
Я дарил тебе цветы, розы, просто так
И ложил к твоим Нью Рокам не один резак
Просто я очень хотел наполнить твой бак
Ложись на кровать, сейчас там будет smack
Со мной три малышки, и мы едем в страшный дом
Они даже не узнают, кто живёт там
У меня есть триста пар Нью Роков, ты не знал
Знакомься, моё имя Blazer из гробовщиков
        """
    },
    {
        "name": "🎸 Хеві метал 2",
        "url": "https://www.youtube.com/watch?v=uAPTLYgiemA&list=RDuAPTLYgiemA&start_radio=1",
        "lyrics": """
[Интро: Blazergosicko]
На мне Affliction, и True Religion
Леймы, отойдите, я вас ненавижу
На Хэллоуине спускайся ниже
Нагнись за тыквой, узнаю побли…

[Предприпев: Blazergosicko]
D-D-DJ Sorrow
Blaze-e-er, а-а-а
Я как THRILL PILL, я как THRILL PILL
Я как THRILL PILL
Я как THRILL PILL, я как THRILL PILL (Ай-яй)
Я как THRILL PILL

[Припев: Blazergosicko]
На мне Affliction, и True Religion
Леймы, отойдите, я вас ненавижу
На Хэллоуине спускайся ниже
Нагнись за тыквой, узнаю поближе

[Куплет 1: midnight blue eyes]
Gothic style, bitch, прыгай на мой член, hoe (Хо-оу)
Я рождённый в поле, сука, выгляжу как CODE (Десять)
Гробовщики восстали и выходят из могил
Православный рэп Сибири, я ща подарил (Ха-ха-ха)
Кровожадная братва не сидит без дела
Нашёл новую тати, и факнул её тело
В дремучий лес заходим, там Фредди Фазбер ходит
Я видел его вроде, он страшно уродлив
Blazer и Midnight разъебали мониторы
Зашли к тебе на ферму и скрутили там по шторе (У-у-у)
Фредди Крюгер под кроватью — это мой будильник
Джейсон Вурхиз за стеной, он нашептал мне имя
Я рождённый в поле, сука, выгляжу как пугало
Она на коленях, и ща будет буга-буга (Ха)
Не ходи в наш Slaughter House, приезжай с подругами
Хочет быть с гробовщиками, но она напугана
        """
    },
    {
        "name": "👜 Ракаю баленсіага",
        "url": "https://www.youtube.com/watch?v=p65mh4BjzG8&list=OLAK5uy_l4L2gm1JpUYBiyNkhcosaZ9bATZQoejO0",
        "lyrics": """
[Интро: Blazergosicko & 3ty1one]
Ракаю Баленсиагу
Ракаю Баленсиагу
Сука Rick Owens и Prada
Сука Rick Owens и Prada
Ракаю Баленсиагу
Ракаю Баленсиагу
Она съела так много, думала, что это мало

[Припев: Blazergosicko & 3ty1one]
Ракаю Баленсиагу
Ракаю Баленсиагу
Сука Rick Owens и Prada
Сука Rick Owens и Prada
Ракаю Баленсиагу
Ракаю Баленсиагу
Она съела так много, думала, что это мало

[Куплет: 3ty1one]
Тяжело дышать рядом с ней
Она хотела быть со мной, где она теперь?
Она хотела носить дизайнеры на ноге
Она очень хотела ездить только по Москве
Отдай свои деньги мне
Этот дизайнер на мне, эти Rick Owens на мне
Худи на мне, CHARLES & KEITH на мне
Ракаю все что есть
Что ты скажешь мне, когда я приеду к тебе?
Что же дальше будет? Я не знаю, пока я с ней

[Бридж: 3ty1one]
На мне рамоны, рамоны, рамоны
Она даёт мне за Вилоны, Вилоны, Вилоны
Всё, что на мне сейчас — Rick Owens, Rick Owens, Rick Owens
А на тебе Off-White палённый, палённый, палённый, а-а

[Припев: Blazergosicko & 3ty1one]
Ракаю Баленсиагу
Ракаю Баленсиагу
Сука Rick Owens и Prada
Сука Rick Owens и Prada
Ракаю Баленсиагу
Ракаю Баленсиагу
Она съела так много, думала, что это мало
Ракаю Баленсиагу
Ракаю Баленсиагу
Сука Rick Owens и Prada
Сука Rick Owens и Prada
Ракаю Баленсиагу
Ракаю Баленсиагу
Она съела так много, думала, что это мало
        """
    },
    {
        "name": "🐗 Хог райда",
        "url": "https://www.youtube.com/watch?v=dd3H5o4HB5o&list=OLAK5uy_knSr9FbH6Ffhc6PtdjffOfGvvSQ0nw7Kw",
        "lyrics": """
[Интро]
Ха

[Припев]
Она любит быть с Блейзером, окей (Хочет быть)
Еду верхом на кабане
Не спорь со мной, стану злей
Не плачь, просто думай обо мне
Любит быть с Блейзером, окей (Ха-а)
Расскажу ей о своей бензопиле
Не прячься, найду тебя, bae (Факт)
Не плачь, просто думай обо мне

[Куплет]
Я хороший бро, но плохой бойфренд
Моя тишка от Affliction для них аргумент
Хочешь быть со мной? Или быть на мне?
О твоей любви, малышка, я не буду петь (Не буду петь)
Едем в страшный дом, это не отель
Тут ножи, бензопилы — всё, что нужно мне
И твои друзья тоже будут здесь
Покажу им приведения, что утащат в лес

[Припев]
Она любит быть с Блейзером, окей (Хочет быть)
Еду верхом на кабане
Не спорь со мной, стану злей
Не плачь, просто думай обо мне
Любит быть с Блейзером, окей (Ха-а)
Расскажу ей о своей бензопиле
Не прячься, найду тебя, bae (Факт)
Не плачь, просто думай обо мне
        """
    },
    {
        "name": "😤 Блейзерго",
        "url": "https://www.youtube.com/watch?v=qahsbJxR4lU&list=OLAK5uy_m6YWjNj-mNFwCaRcL12S_t9nGUSNzpKCo",
        "lyrics": """
[Интро]
Blazer, ах

[Куплет]
I can't talk to those people (А-а)
Они знают, я вышел из тьмы (Вай)
Я слышал, как смеются твои кенты (А-а)
Ну пусть смеются, я войду в эфир
Таким, как я, парень, тебе не быть
Ты знаешь, я этим одержим
Но дай ещё мне пару недель
И я покажу тебе этот дым (А)

[Припев]
Blazer, go! Blazer, go!
Blazer, go! Blazer, go!
Ты знаешь: «Blazer, go!»
Blazer, go! Blazer, go!
Blazer, go!
        """
    },
    {
        "name": "🥵 Блудборн",
        "url": "https://www.youtube.com/watch?v=-TEDH48bBos&list=OLAK5uy_m6YWjNj-mNFwCaRcL12S_t9nGUSNzpKCo&index=2",
        "lyrics": """
[Интро]
Гробовщики смеются всю дорогу над вами

[Предприпев]
(Я-я) Я похож на хоррор, да, я похож на хоррор
Прыгаю в свой Lincoln, и я еду в Лондон
Запалил лишь раз на неё, и стало мокро
Взял с неё Affliction — беру её за бёдра

[Припев]
Да, я похож на хоррор
Прыгаю в свой джип, еду в Лондон
Я беру её за бёдра
У нас есть ножи, как Bloodborne

[Куплет]
Если ты не знал, то мне всё равно
True Religion, TRUEY JEANS — у меня полно
И она зовёт меня — мой Bloody Angel
Город накрывает тьма, когда я иду

[Предприпев]
(Я-я) Я похож на хоррор, да, я похож на хоррор
Прыгаю в свой Lincoln, и я еду на Лондон
Запалил лишь раз на неё, и стало мокро
Взял с неё Affliction — беру её за бёдра

[Припев]
Да, я похож на хоррор
Прыгаю в свой джип, еду на Лондон
Я беру её за бёдра
У нас есть ножи как Bloodborne
Да, я похож на хоррор
Прыгаю в свой джип, еду на Лондон
Я беру её за бёдра
У нас есть ножи как Bloodborne

[Аутро]
Гробовщики смеются всю дорогу над вами
        """
    },
    {
        "name": "🫦 Zовут",
        "url": "https://www.youtube.com/watch?v=YGV3fp6YT2Y&list=OLAK5uy_m6YWjNj-mNFwCaRcL12S_t9nGUSNzpKCo&index=3",
        "lyrics": """
[Интро]
Девочки зовут меня папа
Пацаны зовут меня next up
А-а-а, ха

[Припев]
Девочки зовут меня папа
Пацаны зовут меня next up
Рэперы зовут меня оппом
Только я не знаю сам, кто я
Девочки зовут меня папа
Пацаны зовут меня next up
Рэперы зовут меня оппом
Только я не знаю сам, кто я

[Куплет]
Я проснулся утром, надел свои New Rock'и
И пошёл гулять, я не делаю уроки
Может быть, ты хочешь кофе, я выпил твои соки
True Religion я люблю, но ещё больше твои ноги
I love you, baby, you know, forever
Мы забудем обо всех, мы забудем обо всех, я
Blazer из гробовщиков любит тебя очень
И утащит в страшный дом, утащит на денёчек

[Предприпев]
Девочки зовут меня папа
Пацаны зовут меня next up
Рэперы зовут меня оппом
Только я не знаю сам, кто я

[Припев]
Девочки зовут меня папа
Пацаны зовут меня next up
Рэперы зовут меня оппом
Только я не знаю сам, кто я
        """
    },
    {
        "name": "🔍 Найті",
        "url": "https://www.youtube.com/watch?v=pSLIJNv9074&list=OLAK5uy_m6YWjNj-mNFwCaRcL12S_t9nGUSNzpKCo&index=4",
        "lyrics": """
[Припев]
За окном полумрак
Я одет как ведьмак
Заберу в страшный дом
Не вернуться назад
Найти бы тебя
Гробовщик, ты увидишь ночью нас
Вискарь безо льда
Блейзер не поверит их слезам

[Куплет]
Наш красный подвал
Он тоже хранит много тайн
Отправить тебя к небесам?
Здесь холодно как Амстердам
Не стоит доверять чудесам
Закрой свои веки
Я лежал с тобой в поле каждый день
Блейзер и [night boy?] здесь
Этим летом приезжай к нам на weekend
Если видишь ночью нас
То беги скорей назад
Гробовщицкий вайб найдет тебя везде

[Припев]
За окном полумрак
Я одет как ведьмак
Заберу в страшный дом
Не вернуться назад
Найти бы тебя
Гробовщик, ты увидишь ночью нас
Вискарь безо льда
Блейзер не поверит их слезам
        """
    },
    {
        "name": "🔫 Дробовік",
        "url": "https://www.youtube.com/watch?v=R0rT28TR-H0&list=OLAK5uy_m6YWjNj-mNFwCaRcL12S_t9nGUSNzpKCo&index=6",
        "lyrics": """
[Интро]
Blazer in this bitch
Да, я встал на парковке будто гробовщик

[Припев]
Да, я встал на парковке будто гробовщик
Будто гробовщик, будто гробовщик
Будто гробовщик, будто гробовщик
Я танцую на парковке, мне нужен дробовик
Нужен дробовик, нужен дробовик
Да, я встал на парковке будто гробовщик
Будто гробовщик, будто гробовщик
Я танцую на парковке, мне нужен дробовик
Нужен дробовик, нужен дробовик

[Куплет]
В поле я один, курю, нет это не фильм
Это катафалк, детка, давай прыгай в Бэтмобиль
Да я гробовщик детка, если хочешь - я твой
Blazer bitch, да я гробовщик всерьёз
Я вхожу в азарт, принимаю токсин
Она любит мое тело так,как будто газолин
Не помню ничего совсем,о чем не спросил
Мне не нужно мое сердце я железный почти
Я был хороший man но я схавал four pills
Я как будто в Silen Hill, больше у меня нету дел
Sказал приходи, потом сказал ей свали
Моя маска скажет за меня, напугана bitch

[Припев]
Да, я встал на парковке будто гробовщик
Будто гробовщик, будто гробовщик
Будто гробовщик, будто гробовщик
Я танцую на парковке, мне нужен дробовик
Нужен дробовик, нужен дробовик
Да, я встал на парковке будто гробовщик
Будто гробовщик, будто гробовщик
Я танцую на паркове, мне нужен дробовик
Нужен дробовик, нужен дробовик
        """
    }
]

SPOTIFY_TRACKS = [track["url"] for track in TRACKS_DATA]